[
    {
        "date":1591574400,
        "lesson":"I learned how to the React-based graphing libraries Nivo and ReCharts to visualize user activity over time. Also learned to the SQL GROUP BY function to summarize timestamp logs based on the day."
    },
    {
        "date":1591747200,
        "lesson":"Using the native time format in PostgreSQL is way easier than parsing and formatting every time."
    },
    {
        "date":1591833600,
        "lesson":"I learned that it's really important to focus on the little things in frontend design. Ant Design does beautiful tables, with built in sorting and pagination."
    },
    {
        "date":1591920000,
        "lesson":"Learned the importance of checking my emails more often. Also learned that POST requests take some time."
    },
    {
        "date":1592006400,
        "lesson":"If you're a student developer, the free stuff from Github's Student Developer Pack is a huge money saver for projects."
    },
    {
        "date":1592092800,
        "lesson":"Website translations are tough. I discovered Weglot, and a business model that is blatantly obvious in hindsight."
    },
    {
        "date":1592179200,
        "lesson":"People who work in the produce distribution business really do hustle. I met someone at the food terminal who wakes up at 12am to drive 2 hours downtown and sell flowers from his truck by himself."
    },
    {
        "date":1592265600,
        "lesson":"It's important to have a ritual of some sort. They are great ways to practice doing something with commitment."
    },
    {
        "date":1592352000,
        "lesson":"Learned about application pipelines and the continuous integration deployment process."
    },
    {
        "date":1592438400,
        "lesson":"It's important to stay in touch with friends and reach out to new people. Don't let circumstances such as quarantine serve as excuses not to contact people in other ways. "
    },
    {
        "date":1592524800,
        "lesson":"Learned about Azure resource groups and how to use them."
    },
    {
        "date":1592611200,
        "lesson":"The importance of talking to people. Their perspectives, ideas, and experiences open your eyes up to the things that you didn't even know you knew. Also learned that people are super approachable."
    },
    {
        "date":1592697600,
        "lesson":"It's a good sign if you are asked for low level details after presenting a high level overview of a product/idea."
    },
    {
        "date":1592611200,
        "lesson":"We underestimate how much we can achieve by putting 10 hours everyday into something - Ming"
    },
    {
        "date":1592870400,
        "lesson":"There's a lot of free time in the day if you know where to look."
    },
    {
        "date":1592956800,
        "lesson":"You can never plan for a conversation. Just go with the flow and see where it takes you!"
    },
    {
        "date":1593043200,
        "lesson":"For most people, probability is about what may happen in the future, not events in the observer past; an event that has taken place has 100% probability - Nassim Nicholas Taleb"
    },
    {
        "date":1593129600,
        "lesson":"Got more familiar building unit tests with pytest."
    },
    {
        "date":1593216000,
        "lesson":"Doing portages is a lot harder with metal canoes!"
    },
    {
        "date":1593302400,
        "lesson":"Learned how to steer a canoe, and skip portages by going through shallow waters."
    },
    {
        "date":1593388800,
        "lesson":"Learned how to properly make a vc pitch deck. How not to overcomplicate things, and lay out content in a box format."
    },
    {
        "date":1593561600,
        "lesson":"When making shanghai style buns, you need to pull lengthwise instead of with a twisting fashion at the top."
    },
    {
        "date":1593820800,
        "lesson":"Woodpecker's tongues wrap around the back of their brains."
    },
    {
        "date":1593907200,
        "lesson":"Learned how to do gradient descent in linear regression using Octave. Also learned how to use vectorization in gradient descent."
    },
    {
        "date":1593993600,
        "lesson":"Started learning how to use functional components instead of React classes."
    },
    {
        "date":1594080000,
        "lesson":"Learned how to make gradients in Figma. Also learned how to make gradient icons in Adobe Illustrator."
    },
    {
        "date":1594166400,
        "lesson":"If you can, use serverless infrastructure when you first build a product. Dev time saved >> money saved. Also an idea's only worth your time when you are excited about it."
    },
    {
        "date":1594252800,
        "lesson":"Most midrange electric keyboards have hammer actions that feel better than upright pianos."
    },
    {
        "date":1594339200,
        "lesson":"The design practice for using Post/Get requests. Use Post if you are modifying a database, Get otherwise."
    },
    {
        "date":1594425600,
        "lesson":"Had a call with Mozilla Builders organizer team, and learned about the expectations of MVP labs: the realistic goal is to explore an idea, not create an IPO."
    },
    {
        "date":1594512000,
        "lesson":"Learned how to use gradient descent in logistic regression."
    },
    {
        "date":1594857600,
        "lesson":"Learned how to use Stripe products, prices and subscriptions."
    },
    {
        "date":1594944000,
        "lesson":"The importance of getting a startup up and running (Patrick Lee). One feature, one category, one market. Shrink the market so that you can get a monopoly on it."
    },
    {
        "date":1595030400,
        "lesson":"Learned about the concept of multiclass classification."
    },
    {
        "date":1595116800,
        "lesson":"Learned about overfitting in regression and how to avoid it."
    },
    {
        "date":1595289600,
        "lesson":"Ant financial is the most valuable unicorn in the world. And yet it's almost unheard of in the western world."
    },
    {
        "date":1595376000,
        "lesson":"Built my first Gmail Chrome extension using Gmail.JS."
    },
    {
        "date":1595462400,
        "lesson":"Built a Notion workspace for a company for the first time. The templates are way more powerful than I realized."
    },
    {
        "date":1595548800,
        "lesson":"Call with Adam Cheyer - It's really challenging to build an entire workflow instead of focusing on a specific market. But that creates markets and demand."
    },
    {
        "date":1595635200,
        "lesson":"Made my first Gmail chrome extension."
    },
    {
        "date":1595808000,
        "lesson":"The difference between console.dir and console.log."
    },
    {
        "date":1595894400,
        "lesson":"Made my first Electron app."
    },
    {
        "date":1595980800,
        "lesson":"Started learning how to use electron-builder and electron-webpack. Also learning how to implement basic logistic regression in Octave."
    },
    {
        "date":1596067200,
        "lesson":"Built my first GPT-3 project in Flask."
    },
    {
        "date":1596412800,
        "lesson":"Bought my first stock options. These seem crazy."
    },
    {
        "date":1596499200,
        "lesson":"Learned about the main differences between sql and nosql databases. Also discovered  sqldbm.com, which is a great tool for designing relational databases."
    },
    {
        "date":1596585600,
        "lesson":"Learned the vectorized implementation of forward propagation in neural networks."
    },
    {
        "date":1596672000,
        "lesson":"Understood how multiclass classification is done in neural nets."
    },
    {
        "date":1596931200,
        "lesson":"Programmed a neural network for the first time! It recognizes handwritten digits, and was made in Octave."
    },
    {
        "date":1597017600,
        "lesson":"Learned about the Black-Scholes model and how it's used to predict European option prices."
    },
    {
        "date":1597104000,
        "lesson":"Used the SQLAlchemy Object Relational Mapper for the first time."
    },
    {
        "date":1597190400,
        "lesson":"Got interviewed for an article for the first time! Learned that it's important to maintain a healthy balance of explaining competitive insights if the interviewer's motive is unclear."
    },
    {
        "date":1597276800,
        "lesson":"The logic behind doing gradient checking in ML."
    },
    {
        "date":1597363200,
        "lesson":"Learned how to do back propagation for nerual nets in Octave"
    },
    {
        "date":1597622400,
        "lesson":"Tried using Flask SQLAlchemy for the first time. It's so clean!"
    },
    {
        "date":1597708800,
        "lesson":"Had a chat with Jorma, an ML scientist at Dyno Therapeutics. Big takeaways: it is not hard to get into AI from a software background! Also there are 2 camps in ML: One believes that we need to improve our models to come to a breakthrough, the other believes we just need more data and compute."
    },
    {
        "date":1597795200,
        "lesson":"Finally learned to make my own neural net that does handwriting recognition from the MNIST dataset!"
    },
    {
        "date":1597881600,
        "lesson":"Made my first React Native app. Expo is actually magic!"
    },
    {
        "date":1597968000,
        "lesson":"Made my first Discord bot. It's also going to be talking to a really powerful EC2 instance."
    },
    {
        "date":1598227200,
        "lesson":"Had a great conversation with Ian, and learned a lot about the autonomous driving industry."
    },
    {
        "date":1598313600,
        "lesson":"Learned to use FL Studio for the first time."
    },
    {
        "date":1598659200,
        "lesson":"People are really friendly and are always down to chat about what interests them!"
    },
    {
        "date":1599523200,
        "lesson":"We need more people to share about their experience working at startups."
    },
    {
        "date":1599696000,
        "lesson":"TIL that Google Collab gives you a free GPU to use for your own ai project."
    },
    {
        "date":1599868800,
        "lesson":"Started using Google Magenta for a song generation project."
    },
    {
        "date":1602288000,
        "lesson":"The golden ratio is seen in the conversion from miles to kilometres."
    },
    {
        "date":1603411200,
        "lesson":"Scraped a website for the first time."
    },
    {
        "date":1603584000,
        "lesson":"OpenAI will release an API for MuseNet soon!"
    },
    {
        "date":1603929600,
        "lesson":"The hardware logic behind memory and cache management. Learned about the 90/10 rule: 10% of variables account for 90% of accesses."
    },
    {
        "date":1604016000,
        "lesson":"Dynamic scopes and static scopes."
    },
    {
        "date":1604448000,
        "lesson":"Learned that there are at least 17 known phases of ice."
    },
    {
        "date":1604534400,
        "lesson":"Dropped out of two courses to focus more on things I care about."
    },
    {
        "date":1605052800,
        "lesson":"Computational psychiatry: idea that mental issues stem from specific neurological issues."
    },
    {
        "date":1605916800,
        "lesson":"Covariance matrixes are cool."
    },
    {
        "date":1606608000,
        "lesson":"Learned about the innovations at Bell Labs and its origins at AT&T (American Telephone and Telegraph)."
    },
    {
        "date":1606780800,
        "lesson":"There's a corgi mode in Google Colab!"
    },
    {
        "date":1606867200,
        "lesson":"Learned about Python zip() (about time)"
    },
    {
        "date":1607385600,
        "lesson":"It takes 2 days to hike down the grand canyon. I almost decided to do it on impulse."
    },
    {
        "date":1608768000,
        "lesson":"Used a JavaScript audioBuffer for the first time to visualize audio."
    },
    {
        "date":1608854400,
        "lesson":"Learned about SVMs, and made a spam classifier using one."
    },
    {
        "date":1608940800,
        "lesson":"Building a recipes page on my website."
    },
    {
        "date":1609027200,
        "lesson":"Learning about WebRTC and worked on streaming audio live."
    },
    {
        "date":1609372800,
        "lesson":"Had a chat with Matt from Atmos about the future of development projects: he thinks we should be able to provide fully customized homes to anyone, at scale and affordably."
    },
    {
        "date":1609459200,
        "lesson":"Learning to use NextJS. It's super op!"
    },
    {
        "date":1609545600,
        "lesson":"Used MDX for the first time. It's awesome for blogs."
    },
    {
        "date":1609891200,
        "lesson":"Learning to use Janus to set up a WebRTC connection. Learned about STUN and TURN servers, ICE and Trickle ICE protocols."
    },
    {
        "date":1609977600,
        "lesson":"Learning how to create Opus tracks to stream audio."
    },
    {
        "date":1610064000,
        "lesson":"Used Davinchi Resolve for the first time. It's one of the easiest and most powerful video editors I've used. (and it's free!)"
    },
    {
        "date":1610064000,
        "lesson":"I learned that it is near impossible to stream audio from NodeJS via webrtc. Fingers crossed for something better in the future."
    },
    {
        "date":1610150400,
        "lesson":"r/wallstreetbets is now the second most popular subreddit. Looking at some interesting times ahead (and sell those GME calls while you can btw)."
    }
]