{
    "beef-udon":
    {
        "name": "Beef Udon",
        "subtitle": "Easy peasy michelin star squeezy",
        "description": "If you get the right ingredients, this is an amazingly simple way to make restaurant-quality udon. My roomate said 'it was really good'",
        "image": "/images/cooking/beef-udon.jpg",
        "time":"15 minutes",
        "servings": 2,
        "type": "Main Course",
        "ingredients": [
            {
                "unit": 0.5,
                "item": "tbsp cooking oil"
            },
            {
                "unit": 2,
                "item": "servings udon noodles"
            },
            {
                "header": "For Beef"
            },
            {
                "unit":1,
                "item": "tbsp soy sauce"
            },
            {
                "unit":1,
                "item":"tbsp sugar"
            },
            {
                "unit":2,
                "item":"green onions"
            },
            {
                "header": "For Broth"
            },
            {
                "unit": 1,
                "item": "tbsp mirin"
            },
            {
                "unit": 1,
                "item": "tbsp soy sauce"
            },
            {
                "unit": 1,
                "item": "tsp sugar"
            },
            {
                "unit": 2,
                "item": "cups dashi*"
            }
        ],
        "steps": [
            "In a small saucepan, combine mirin, soy sauce, sugar, and dashi, and bring to a boil. Set aside.",
            "Bring a large pot of water to a boil.",
            "Add udon, and cook on medium-low, covered, for 10 minutes. Turn off heat when done.",
            "Cut the sliced beef into bite sized pieces. Thinly slice the green onions.",
            "Put a large frying pan on medium heat. Add cooking oil, thinly sliced beef and half of the sliced green onion.",
            "When beef is browned and seared, add soy sauce and sugar. Turn off heat after 5 minutes.",
            "Put the udon in serving bowls. Pour in the broth until it almost covers the noodles.",
            "Place cooked beef on top, and sprinkle the remaining sliced green onions.",
            "If you are a fancy pants, you can garnish with bonito flakes, shichimi togarashi, narutomaki, and mitsuba."
        ],
        "notes": [
            "*: You can make dashi by mixing instant dashi powder with water."
        ]
    },
    "taiwanese-fried-chicken":
    {
        "name": "Taiwanese Fried Chicken",
        "subtitle": "High effort but high reward",
        "description": "I make these whenever I am craving Asian street food. This always brings me back to my 2019 trip to Taiwan. \n\nSee notes section for items marked *",
        "image": "https://i0.wp.com/seonkyounglongest.com/wp-content/uploads/2020/03/Taiwanese-Fried-Chicken1.jpg?fit=1300%2C867&ssl=1",
        "time":"2-3 hours",
        "servings": 2,
        "type": "Appetizer",
        "ingredients": [
            {
                "unit": 1,
                "item": "tbsp fermented bean curd"
            },
            {
                "unit": 1,
                "item": "tbsp oyster sauce"
            },
            {
                "unit": 1,
                "item": "tsp shaoxing wine"
            },
            {
                "unit": 0.25,
                "item": "tsp white pepper"
            },
            {
                "unit": 3,
                "item": "cloves garlic, chopped"
            },
            {
                "unit": 1,
                "item": "lb boneless skinless chicken thighs, cut into 1\" cubes"
            },
            {
                "item": "peanut oil or frying oil"
            },
            {
                "unit": 0.75,
                "item": "cup sweet potato flour"
            },
            {
                "unit": 1,
                "item": "tsp salt"
            },
            {
                "unit": 0.5,
                "item": "tsp Sichuan peppercorn, toasted and ground up"
            },
            {
                "unit": 0.5,
                "item": "tsp white pepper"
            },
            {
                "unit": 0.25,
                "item": "cayenne or papripka powder"
            },
            {
                "unit": 1,
                "item": "handful Thai basil"
            }
        ],
        "steps": [
            "In a bowl, mix the fermented bean curd, oyster sauce, shaoxing wine white pepper and garlic.",
            "Add the chicken and coat it in sauce. Cover the bowl and marinate for 2-12 hours.",
            "Heat frying oil to 350°F.",
            "For each piece of chicken, coat it in the sweet potato starch and drop it in the frying oil. Fry the chicken for 3-4 minutes, until it is floating on the surface of the oil. *",
            "Remove the cooked chicken from the oil and place on a rack to cool.",
            "Increase the oil temperate to 400°F. While waiting, mix salt, Sichuan peppercorn, white pepper and paprika in a small bowl.",
            "Add half of the first bach of chicken and fry it for 30 seconds. Add half of the basil into the oil and immediately cover the pot. Count to 5, uncover, and remove the chicken and basil from the oil.",
            "Repeat the previous step for the remaining chicken and basil. *",
            "Sprinkle the dry seasoning mixture on top of the fried chicken. Serve immediately!"
        ],
        "notes": [
            "Cook the chicken in batches of 2 or 3 to avoid crowding the pot. Otherwise, the oil will get too cold and the chicken pieces will stick to each other.",
            "Vary batch size based on the amount of chicken and pot size."
        ]
    },
    "tomato-and-egg":
    {
        "name": "Stir-fried Tomato and Eggs",
        "subtitle": "The greatest thing before sliced bread",
        "description": "A tasty staple in the Chinese diet. If I was told to make a dish in 5 minutes or less, I would go for this.\n\nSee notes section for items marked *",
        "image": "/images/cooking/tomato-egg.jpg",
        "time":"10 minutes",
        "servings": 2,
        "type": "Main Course",
        "ingredients": [
            {
                "unit":2,
                "item": "eggs, large"
            },
            {
                "unit":4,
                "item":"roma tomatoes, cubed to 1.5\" pieces *"
            },
            {
                "unit":1,
                "item":"tbsp cooking oil"
            },
            {
                "unit":3,
                "item":"tbsp soy sauce *"
            },
            {
                "unit": 1,
                "item": "green onion, chopped"
            }
        ],
        "steps": [
            "Add oil to a medium pan. Heat on high until the oil just starts to shimmer.",
            "Immediately break eggs and add to the pan. The high heat will make the eggs spatter, which airs them up. Quickly scramble the eggs until they are solid and set them aside.",
            "Turn the heat to medium. Add tomatoes and soy sauce.",
            "Cover pan, add soy sauce, and cook for 5-10 minutes until the tomato skin easily slides off.",
            "Stir in  the eggs and green onions. Serve!"
        ],
        "notes": [
            "Any tomato works as a substitute. 4 roma tomatoes is equal to roughly 250g of tomato. If you feel extra, you can peel the tomato skins for a smoother texture.",
            "I prefer the soy sauce version of this dish. If you don't, use salt to taste instead. This dish is on the saliter side because I recommend you eat it with rice."
        ]
    },
    "blueberry-ice-cream":
    {
        "name": "Blueberry Ice Cream",
        "subtitle": "Cheap and easy gourmet ice cream",
        "description": "The friends at Topos reviewed loved this one! They say it taste better than store-bought. \"\n\nSee notes section for items marked *",
        "image": "/images/cooking/blueberry-ice-cream.jpg",
        "time":"3 hours",
        "servings": 5,
        "type": "Dessert",
        "ingredients": [
            {
                "unit":2,
                "item": "cups blueberries *"
            },
            {
                "unit":1,
                "item":"cup sugar"
            },
            {
                "unit":1,
                "item":"cup whole milk"
            },
            {
                "unit":1,
                "item":"cup whipping cream"
            }
        ],
        "steps": [
            "Add blueberries and sugar to a medium saucepan. Add a spoon of water.",
            "Heat on medium until the mixture melts and starts boiling.",
            "Turn the heat to low. Simmer, stirring occasionally, for 10 minutes.",
            "Let the mixture cool for 20 minutes.",
            "Put in a blender, and blend until you get a smoothie texture.",
            "Pour in a bowl/tub, and mix in milk and cream.",
            "Put in a freezer, and enjoy when it becomes solid."
        ],
        "notes": [
            "Frozen or fresh blueberries does not matter"
        ]
    },
    "goi-cuon":
    {
        "name": "Gỏi Cuốn",
        "subtitle": "Highest flavor to effort ratio",
        "description": "My go-to for quick Vietnamese eats! It's an amazingly refreshing meal. \"\n\nSee notes section for items marked *",
        "image": "/images/cooking/goi-cuon.jpg",
        "time":"0.5 hours",
        "servings": 4,
        "type": "Main Course",
        "ingredients": [
            {
                "unit":10,
                "item": "sheets rice paper"
            },
            {
                "unit":250,
                "item":"grams rice vermicelli"
            },
            {
                "unit":3,
                "item":"sprigs fresh basil"
            },
            {
                "unit":0.5,
                "item":"head lettuce"
            },
            {
                "unit":2,
                "item":"cups bean sprouts"
            },
            {
                "unit":0.5,
                "item":"lb large shrimp *"
            },
            {
                "item":"hoisin sauce"
            },
            {
                "header":"For the dipping sauce"
            },
            {
                "unit":1,
                "item":"tbsp fish sauce"
            },
            {
                "unit":3,
                "item": "tbsp water"
            },
            {
                "unit":1,
                "item": "clove garlic, minced"
            },
            {
                "unit":1,
                "item": "tbsp lime juice"
            },
            {
                "unit": 0.5,
                "item": "tsp chili garlic sauce"
            }
        ],
        "steps": [
            "Bring a medium saucepan of water to boil. Boil rice vermicelli and shrimp 5 minutes.",
            "Drain, pouring some of the hot water in a plate for later.",
            "Cut shrimp in half, lengthwise.",
            "Dip one wrapper into the saved hot water for 2 seconds to soften. Lay wrapper flat on a plate, and place on it a handful total of vermecelli, shrimp, basil, lettuce, and bean sprouts.",
            "Fold two sides of the wrapper in to the center. Bring the bottom up to cover the center, and roll it up like a burrito.",
            "Repeat steps 4-5 for other wrappers.",
            "Mix the sauce ingredients together in a small bowl. Put some hoison sauce into another bowl.",
            "Dip the rolls in the sauce and enjoy!"
        ],
        "notes": [
            "If the shrimp are not peeled and devined, make sure to do that carefully with a knife after boiling them."
        ]
    },
    "sheng-jian-bao":
    {
        "name": "Sheng Jian Bao",
        "subtitle": "Shanghai style pan-fried pork buns",
        "description": "I love making these with friends. The filling is where the flavor is at, so if that part is done right you get a good bao.",
        "image": "https://thefoodistuk.files.wordpress.com/2015/02/img_1503.jpg",
        "time":"1.5 hours",
        "servings": 2,
        "type": "Main Course",
        "ingredients": [
            {
                "header": "For the wrappers"
            },
            {
                "unit": 250,
                "item": "g all-purpose flour"
            },
            {
                "unit": 1,
                "item": "tsp sugar"
            },
            {
                "unit": 1,
                "item": "tsp dried instant yeast"
            },
            {
                "unit": 140,
                "item": "ml lukewarm water"
            },
            {
                "header": "For the filling"
            },
            {
                "unit": 250,
                "item": "g minced pork"
            },
            {
                "unit": 2,
                "item": "tbsp spring onion, finely chopped"
            },
            {
                "unit": 0.5,
                "item": "tbsp ginger, minced"
            },
            {
                "unit": 2,
                "item": "tsp soy sauce"
            },
            {
                "unit": 0.5,
                "item": "tsp Shaoxing rice wine"
            },
            {
                "unit": 0.5,
                "item": "tsp sesame oil"
            },
            {
                "unit": 0.25,
                "item": "tsp salt"
            },
            {
                "unit": 1,
                "item": "pinch Chinese five-spice powder"
            },
            {
                "unit": 5,
                "item": "tbsp water or chicken stock"
            },
            {
                "header": "For frying"
            },
            {
                "unit": 1,
                "item": "tbsp cooking oil"
            },
            {
                "unit": 250,
                "item": "ml water"
            },
            {
                "header": "Garnish"
            },
            {
                "item": "Toasted sesame seeds"
            },
            {
                "item": "Spring onion, finely chopped"
            }
        ],
        "steps": [
            "SECTIONPrepare the dough",
            "In a large bowl, mix flour, yeast and sugar. Pour in water little by little while stirring with a pair of chopsticks (or a fork).",
            "Knead with your hand until a smooth, elastic dough forms. Cover the bowl with a wet kitchen towel.",
            "Leave to rise in a warm place until double in size. It will take between 40 minutes to 1.5 hours depending on the room temperature.",
            "SECTIONMix the filling",
            "Put all the ingredients for the filling into a large bowl. Slowly swirl in water/stock into the mixture.",
            "SECTIONShape the buns",
            "Knead the dough on a floured work surface until it goes back to its original size.",
            "Divide it into 20 equal portions. Roll each piece into a disk-like wrapper.",
            "Hold the wrapper in the palm of one hand. Place some filling in the middle. Use the other hand to fold the edge anticlockwise by pinching with thumb and index finger until the bun is completely sealed.",
            "Leave to rest for 15 minutes before frying.",
            "SECTIONFry the buns",
            "Heat up oil in a frying pan over a high heat. Place in the buns.",
            "When the bottom part becomes golden brown, pour in water then cover with a lid.",
            "Uncover when the water evaporates completely. Sprinkle sesame seeds and spring onion over.",
            "Cook another 30 seconds or so to crisp up."
        ],
        "notes": [
            "I found instant yeast to be quite effective, but any type of yeast works. I learned the hard way that baking powder doesn't work!"
        ]
    },
    "italian-wedding-soup":
    {
        "name": "Italian Wedding Soup",
        "subtitle": "Authentic tasting, hearty American x Italian soup",
        "description": "This was the dish that convinced my Mom to give Italian food a chance. It's hearty so it's great as a quick meal for later.",
        "image": "https://www.onceuponachef.com/images/2017/11/Italian_Wedding_Soup_.jpg",
        "time":"50 minutes",
        "servings": 6,
        "type": "Main Course",
        "ingredients": [
            {
                "header": "For the meatballs"
            },
            {
                "unit": 250,
                "item": "g lean ground beef"
            },
            {
                "unit": 0.5,
                "item": "cup bread crumbs"
            },
            {
                "unit": 0.25,
                "item": "cup chopped fresh parsley"
            },
            {
                "unit": 1.5,
                "item": "tsp minced fresh orgeano"
            },
            {
                "unit": 0.5,
                "item": "cup finely shredded parmesean"
            },
            {
                "unit": 1,
                "item": "tbsp olive oil"
            },
            {
                "unit": 1,
                "item": "large egg"
            },
            {
                "unit": 1,
                "item": "tsp salt"
            },
            {
                "unit": 0.25,
                "item": "tsp pepper"
            },
            {
                "header": "For the soup"
            },
            {
                "unit": 1,
                "item": "tbsp olive oil"
            },
            {
                "unit": 1.5,
                "item": "cups carrots, diced"
            },
            {
                "unit": 1.5,
                "item": "cups yellow onion, diced"
            },
            {
                "unit": 0.75,
                "item": "cups celery, diced"
            },
            {
                "unit": 4,
                "item": "cloves garlic, minced"
            },
            {
                "unit": 5,
                "item": "cans chicken broth (~1.75L)"
            },
            {
                "unit": 1,
                "item": "cup orzo pasta"
            },
            {
                "unit": 175,
                "item": "g fresh spinach, chopped"
            }
        ],
        "steps": [
            "SECTIONMake the meatballs",
            "Mix meatball ingredients in a bowl.",
            "Shape mix into small meatballs, about 3/4 inch to 1 inch and transfer to a plate.",
            "Heat 1 Tbsp olive oil in a large pan over medium-high heat. Add the meatballs and cook, turning occasionally until 2 or 3 sides are browned (about 4 minutes total). They will not be fully cooked at this point.",
            "SECTIONFor the soup",
            "Heat 1 Tbsp olive oil in a large pot over medium-high heat. Add carrots, onions and celery and saute until veggies have softened about 6 - 8 minutes, add garlic and saute 1 minute longer.",
            "Pour in chicken broth, season soup with salt and pepper to taste and bring it to a boil.",
            "Add in pasta and meatballs, reduce heat to light boil.",
            "Cover and cook, stirring occasionally for about 10 minutes.",
            "Add in spinach during the last minute of cooking.",
            "Serve warm, sprinkle each serving with parmesan cheese."
        ],
        "notes": [
            "You can make your own breadcrumbs really easily by leaving white bread out to dry and crushing it.",
            "I prefer to use low sodium chicken broth. If not, I usually don't add salt to the meatballs at all.",
            "Pasta can be substituted with the same amount of rice."
        ]
    },
    "soy-sauce-fried-rice":
    {
        "name": "Soy Sauce Fried Rice",
        "subtitle": "A lunchtime staple",
        "description": "My go-to meal when I have 15 minutes to make food. In actuality, all the ingrients except the soy sauce, oil and rice is optional. Feel free to experiment! \n\nSee notes section for items marked *",
        "image": "https://thewoksoflife.com/wp-content/uploads/2016/08/soy-sauce-fried-rice-10.jpg",
        "time":"15 minutes",
        "servings": 2,
        "type": "Main Course",
        "ingredients": [
            {
                "header": "Sauce mixture"
            },
            {
                "unit":1,
                "item": "tbsp dark soy sauce*"
            },
            {
                "unit":1,
                "item":"tbsp light soy sauce"
            },
            {
                "unit": 0.5,
                "item": "tbsp cooking oil"
            },
            {
                "unit": 0.5,
                "item": "tsp sugar"
            },
            {
                "unit":0.5,
                "item":"tsp oyster sauce (optional)"
            },
            {
                "unit":1,
                "item":"tsp fish sauce (optional)"
            },
            {
                "header":"For the fried rice"
            },
            {
                "unit": 1,
                "item": "cup mixed vegetables (optional)*"
            },
            {
                "unit":2,
                "item": "eggs"
            },
            {
                "unit": 3,
                "item": "cups cooked rice"
            },
            {
                "unit": 2,
                "item": "green onions, chopped"
            }
        ],
        "steps": [
            "Add oil to a medium pan. Heat on high until the oil just starts to shimmer.",
            "Immediately break eggs and add to the pan. The high heat will make the eggs spatter, which airs them up. Quickly scramble the eggs, and set them aside.",
            "Turn the heat to medium. Add oil and rice.",
            "Stir rice and break up clumps, until the rice is heated through.",
            "Add all the ingredients for the sauce mixture, veggies and scrambled eggs to the rice.",
            "Stir fry eveything until combined. Add more soy sauce to taste if needed.",
            "Stir in the green onions, and serve."
        ],
        "notes": [
            "Any veggies that aren't really watery (like tomatoes), and smaller than half your thumb is good. My go-to is frozen mixed vegetables, or whatever veggies in the fridge, diced.",
            "This can be replaced by half the amount of light soy sauce"
        ]
    }
}